# Construction Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Construction Properties
Construction Class See Also
---
The Construction type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | Get the id of the Construction. |
| Name | Get the name of the Construction. |

# See Also
Construction Class
Autodesk.Revit.DB Namespace